# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

numbers = [1, 3, 4, -1, 4, 10, -5]

summa = 0

for number in numbers:
    summa += number

print(sum)

