# Два числа хранятся в переменных. Напишите программу, меняющую значение переменных местами:
# a = 5
# b = 7
# print("a =", a, "b =", b)  # Выводит a = 5 b = 7
# # Тут ваш код
# print("a =", a, "b =", b)  # Должно вывести a = 7 b = 5
# Примечание: код самих print'ов не менять!a = 5

#Method - 1
# a = 5
# b = 7
#
# c = a
# a = b
# b = c
# print("a =", a, "b =", b)

#Method - 2
# a = 5
# b = 7
#
# a = a + b
# b = a - b
# a = a - b
# print("a =", a, "b =", b)

#Method - 2
a = 5
b = 7

a,b = b,a
print("a =", a, "b =", b)